# Homebrew Bundle file
# Run with: brew bundle

# Taps
tap "neovim/neovim"
tap "common-fate/granted"
tap "nikitabobko/tap"
tap "1password/tap"
tap "koekeishiya/formulae"

# Core utilities
brew "coreutils"
brew "automake"
brew "autoconf"
brew "openssl"
brew "libyaml"
brew "readline"
brew "libxslt"
brew "libtool"
brew "unixodbc"
brew "unzip"
brew "gpg"

# Development tools
brew "git"
brew "git-delta"
brew "gh"
brew "vim"
brew "neovim"
brew "wget"
brew "curl"
brew "go"
brew "deno"
brew "pipx"
brew "luarocks"
brew "luajit"

# Cloud and infrastructure
brew "awscli"
brew "terraform"
brew "terraform-ls"
brew "tflint"
brew "granted"

# Terminal tools
brew "bat"
brew "btop"
brew "direnv"
brew "eza"
brew "fzf"
brew "gum"
brew "htop"
brew "jq"
brew "trash"
brew "starship"
brew "stow"
brew "tmux"
brew "reattach-to-user-namespace"
brew "terminal-notifier"
brew "zoxide"
brew "fd"
brew "ripgrep"
brew "sesh"
brew "tree"
brew "fastfetch"
brew "yq"

# Enhanced shell tools
brew "navi"        # Interactive cheatsheet tool
brew "tldr"        # Simplified man pages
brew "glow"        # Markdown rendering in terminal
brew "just"        # Modern command runner
brew "watchexec"   # File watcher for development
brew "carapace"    # Multi-shell command argument completion

# Database tools
brew "mysql-client@8.4"
brew "sqlite"
brew "lazysql"

# Development utilities
brew "xh"
brew "gnu-sed"
brew "viu"
brew "stylua"
brew "diff-so-fancy"
brew "lazydocker"
brew "lazygit"
brew "fontconfig"
brew "imagemagick"
brew "shellcheck"

# Advanced development tools
brew "mise"
brew "git-cliff"    # Automated changelog generation
brew "lefthook"     # Modern git hooks manager
brew "git-absorb"   # Automatically fixup commits
brew "gitui"        # TUI for git
brew "sccache"      # Shared compilation cache

# Window management
brew "yabai"

# Casks (GUI applications)
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "bartender"
cask "choosy"
cask "cleanmymac"
cask "cleanshot"
cask "discord"
cask "figma"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"
cask "github@beta"
cask "ghostty"
cask "google-chrome"
cask "home-assistant"
cask "inkscape"
cask "karabiner-elements"
cask "nordvpn"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "readdle-spark"
cask "sizzy"
cask "slack"
cask "todoist"
cask "zed"

# Mac App Store apps
mas "1Password for Safari", id: 1569813296
